/**
 * Created by 戴小俊 on 2018/11/16.
 */
import Vue from 'vue'
import Vuex from 'vuex'
import mutations from './mutations'
import actions from './actions'
import getters from './getters'

Vue.use(Vuex)

const state = {
  classify: false, // 菜谱分类页面
  details: false, // 哈友生活秀详情
  setting: false, // 设置的页面
  hot: true, // 收缩页面的热搜
  result: {
    recommend: [], // 好友推荐
    cereal: [], // 早餐
    lunch: [], // 午餐
    supper: [] // 晚餐
  },
  cookbook: [], // 请求网络数据
  calssIfy: {}, // 存储数据
  melas: [], // 三餐详情页面
  settingGo: false, // 登录页面显示头像
  menu: false, // 发菜谱页面
  addStep: false, // 发菜谱中调整步骤页面
  step: 3, // 发菜谱页面步骤
  show: false, // 个人信息的分享页面
  message: false, // 消息页面
  arry: ['蛋挞', '鱼香肉丝', '主食', '面条', '素菜', '早餐', '芹菜', '可乐鸡翅', '鲫鱼', '红烧茄子', '鸡肉', '虾'],
  data: ['健康', '小吃', '特产'],
  sort: {
    hot: ['家常菜', '素菜', '凉菜', '早餐', '下饭菜', '川菜', '面食', '汤', '粥', '小吃', '东北菜', '晚餐', '蛋糕', '粤菜', '寿司', '汤羹', '湘菜', '西餐', '面包', '披萨', '中餐', '水产', '饼', '糕点', '甜点', '炒饭', '砂锅', '清淡', '馒头', '卤菜', '饮料', '饺子', '炒面', '包子', '冰激凌', '泡菜', '面条', '月饼', '沙拉', '粽子', '热菜', '创意菜', '料理', '三明治'],
    meat: {
      pork: ['猪肉', '排骨', '猪蹄', '猪肚', '五花肉', '猪肝', '猪血', '猪腰', '猪耳朵', '猪心', '猪脑袋', '猪排', '猪蛇头', '猪大肠'],
      beef: ['牛肉', '牛腩', '牛排', '肥牛', '牛肚', '牛蹄筋', '牛尾', '牛鞭', '牛肾'],
      chicken: ['鸡肉', '鸡翅', '鸡腿', '鸡爪', '鸡肝', '鸡胗', '鸡血', '鸡心', '火鸡肉', '乌鸡'],
      duck: ['鸭肉', '鸭肝', '鸭腿', '鸭翅', '鸭胗', '鸭头', '鸭血', '鸭肠'],
      rest: ['兔肉', '驴肉', '鹅肉', '雪蛤', '鹧鸪', '鹅肝', '蚕蛹', '乳鸽', '鸽肉', '蝼蛄']
    },
    egg: ['鸡蛋', '鸭蛋', '鹌鹑蛋', '咸鸭蛋', '鸽子蛋', '松花蛋', '鹅蛋'],
    product: {
      prawn: ['虾', '虾米', '龙虾', '虾皮', '海虾', '北极虾', '基围虾', '小龙虾', '河虾', '皮皮虾', '虾仁'],
      crad: ['螃蟹', '梭子蟹', '河蟹', '面包蟹', '大闸蟹'],
      cowry: ['哈利', '鲍鱼', '干贝', '扇贝', '鲜贝', '文蛤', '海螺', '青口', '河蚌', '淡菜', '生蚝', '北极贝', '毛哈利', '牡蛎'],
      rest: ['墨鱼', '鱿鱼', '章鱼', '海参', '甲鱼', '田螺', '海胆', '海蜇头', '海蜇皮', '田鸡', '牛蛙', '海藻', '海带', '紫菜', '裙带菜', '发菜']
    },
    fish: ['草鱼', '鲤鱼', '鲫鱼', '鲢鱼', '青鱼', '鲶鱼', '罗非鱼', '武昌鱼', '桂鱼', '泥鳅', '黄鳝', '带鱼', '鲈鱼', '鳕鱼', '金枪鱼', '鳗鱼', '三文鱼', '秋刀鱼', '比目鱼', '沙丁鱼', '石斑鱼', '黄花鱼', '小黄鱼', '鱼干', '鱼籽'],
    vegetables: {
      stem: ['白菜', '油菜', '芹菜', '菠菜', '韭菜', '生菜', '莴苣', '莴笋', '茭白', '西兰花', '娃娃菜', '韭黄', '紫甘蓝', '油麦菜', '芦荟', '卷心菜', '豌豆苗', '藜蒿', '栀子花', '豆瓣菜'],
      rhizome: ['土豆', '芋头', '胡萝卜', '竹笋', '山药', '藕', '菱角', '青萝卜', '豆角', '茄子', '青椒', '西红柿', '荷兰豆'],
      melon: ['扁豆', '黄瓜', '南瓜', '丝瓜', '苦瓜', '四季豆', '秋葵', '葫芦', '腰果叶'],
      set: ['蘑菇', '草菇', '平菇', '金针菇', '猴头菇', '茶树菇', '鸡腿菇', '牛肝菌', '木耳', '凤尾菇', '虫草花', '地衣', '红菇', '海鲜菇', '蒜苗', '洋葱', '青蒜', '葱白', '大蒜', '大葱']
    },
    bans: ['绿豆芽', '黄豆芽', '黄豆', '毛豆', '青豆', '蚕豆', '红腰豆', '白豆', '豌豆', '鲜豌豆', '扁豆', '豆腐', '豆腐干', '腐竹', '豆腐皮', '炒黄豆', '千张'],
    grains: ['荞麦面', '面包', '米饭', '粉丝', '米粉', '大米粥', '葛根粉', '糯米粉', '燕麦片', '麦芽', '玉米', '谷芽', '小麦', '大麦', '青稞', '红曲', '黑米粥', '香米'],
    drug: ['燕窝', '人参', '桂花', '罗汉果', '枸杞', '鸡骨草', '葛根', '山楂叶', '金银花', '鱼腥草', '甘草', '薄荷', '西洋参', '陈皮', '灵芝', '桔皮', '大黄', '玉兰花', '蜂胶']
  }
}

export default new Vuex.Store({
  state,
  actions,
  getters,
  mutations
})
